[
    {
        "Tag": "<!DOCTYPE html>",
        "Description": "Basically tells the browser what kind of document we're loading, in this case good 'ol HTML. This guy likes to be the first element in the document, even before the opening <html> tag. This page, for example, starts things off with <!DOCTYPE html>"
    },
    {
        "Tag": "<!-- -->",
        "Description": "For commenting out sections of HTML or placing comments within HTML. Anything between <!-- and --> wont be rendered as text when the page loads in a web browser, but will still be visible if looking at the plain 'ol HTML file in a text editor."
    },
    {
        "Tag": "<a>",
        "Description": "a for anchor, also known as a hyperlink, or simply a link. To make an actual link using the <a> tag, use the href attribute: <a href=\"http: //eastmanreference.com\">Link</a>"
    },
    {
        "Tag": "<abbr>",
        "Description": "Abbr is an abbreviation for abbreviation. Use it with the title attribute to define abbreviations. <abbr title=\"Cascading Style Sheets\">CSS</abbr>. Safari 12.0 hovering the mouse over CSS brings up a little tool tip generated by the abbreviation tag."
    },
    {
        "Tag": "<address>",
        "Description": "Contact information for the author. Alternatively, this could be general contact information for the website."
    },
    {
        "Tag": "<area>",
        "Description": "Establishes areas in an image map. <area> is always used inside of <map>."
    },
    {
        "Tag": "<article>",
        "Description": "The <article> tag is new in HTML5. This tag can be used to contain blog entries, forum posts, etc."
    },
    {
        "Tag": "<aside>",
        "Description": "New in HTML5. The <aside> element is for making sidebars that are placed next to the main content."
    },
    {
        "Tag": "<audio>",
        "Description": "New in HTML5. The <audio> tag can be used to place an audio stream within an HTML document."
    },
    {
        "Tag": "<b>",
        "Description": "For bolding or otherwise styling text without conveying any additional meaning such as with <em> and <strong> and etc."
    },
    {
        "Tag": "<base>",
        "Description": "Use to set a base URL."
    },
    {
        "Tag": "<bdi>",
        "Description": "Short for bidirectional isolation. Useful for working with languages that use right to left text."
    },
    {
        "Tag": "<bdo>",
        "Description": "Short for Bidirectional Override. Use this to override the current direction of text. Useful for languages that use right to left text."
    },
    {
        "Tag": "<blockquote>",
        "Description": "For quoting from an external source. Typically rendered as indented text."
    },
    {
        "Tag": "<body>",
        "Description": "Establishes the body of an HTML document."
    },
    {
        "Tag": "<br>",
        "Description": "Single line break. Think of br as short for break."
    },
    {
        "Tag": "<button>",
        "Description": "Specifies button that can be clicked. Commonly used with forms."
    },
    {
        "Tag": "<canvas>",
        "Description": "Used for rendering graphics on the fly, typically in conjunction with a scripting language."
    },
    {
        "Tag": "<caption>",
        "Description": "Placed just after <table>, used for table caption."
    },
    {
        "Tag": "<cite>",
        "Description": "For citing."
    },
    {
        "Tag": "<code>",
        "Description": "For code examples. A little bit like <samp> and <kbd>, but specifically for code."
    },
    {
        "Tag": "<col>",
        "Description": "Specify properties of a <col> within a <colgroup>"
    },
    {
        "Tag": "<colgroup>",
        "Description": "Essentially a group of columns."
    },
    {
        "Tag": "<data>",
        "Description": "Used for script friendly data."
    },
    {
        "Tag": "<datalist>",
        "Description": "New in HTML5. Specify predefined data for an <input>."
    },
    {
        "Tag": "<dd>",
        "Description": "For description lists. Use with <dt> and <dl>."
    },
    {
        "Tag": "<del>",
        "Description": "Mark text as deleted without actually deleting it. This will typically be rendered as a strikethrough."
    },
    {
        "Tag": "<details>",
        "Description": "New in HTML5. Can be used for additional details which can be hidden or revealed."
    },
    {
        "Tag": "<dfn>",
        "Description": "Use when first defining a term."
    },
    {
        "Tag": "<dialog>",
        "Description": "Dialog box."
    },
    {
        "Tag": "<div>",
        "Description": "A divider or a kind of generic container."
    },
    {
        "Tag": "<dl>",
        "Description": "Description list. Use with <dd> and <dt>."
    },
    {
        "Tag": "<dt>",
        "Description": "Description list. Use with and <dl>."
    },
    {
        "Tag": "<em>",
        "Description": "Emphasis, which I believe often defaults to italics. For something stronger, use <strong>."
    },
    {
        "Tag": "<embed>",
        "Description": "New in HTML5. A container for external content."
    },
    {
        "Tag": "<fieldset>",
        "Description": "Group related items in a form."
    },
    {
        "Tag": "<figure>",
        "Description": "Define self contained content such as photos or diagrams."
    },
    {
        "Tag": "<footer>",
        "Description": "The footer of a document, below the main content."
    },
    {
        "Tag": "<form>",
        "Description": "Forms for user input."
    },
    {
        "Tag": "<h1>",
        "Description": "Level 1 heading, the headline or title of a page."
    },
    {
        "Tag": "<h2>",
        "Description": "Level 2 heading, the subtitles of a page."
    },
    {
        "Tag": "<h3>",
        "Description": "Level 3 heading."
    },
    {
        "Tag": "<h4>",
        "Description": "Level 4 heading."
    },
    {
        "Tag": "<h5>",
        "Description": "Level 5 heading."
    },
    {
        "Tag": "<h6>",
        "Description": "Level 6 heading."
    },
    {
        "Tag": "<head>",
        "Description": "The head section. Used mostly for metadata."
    },
    {
        "Tag": "<header>",
        "Description": "Not to be confused with <head>, <header> typically contains introductory content and layout that goes above the body."
    },
    {
        "Tag": "<hgroup>",
        "Description": "Used for grouping <h1>, <h2>, <h3>, etc., tags together. Useful for multilevel headings."
    },
    {
        "Tag": "<hr>",
        "Description": "This can be used for separating text within a paragraph. Typically renders as a horizontal line running across the page."
    },
    {
        "Tag": "<html>",
        "Description": "The root level tag of an HTML document. All other HTML tags go inside the HTML tag."
    },
    {
        "Tag": "<i>",
        "Description": "The <i> element has changed a little in HTML5. It can still make text italicized, and I think that is often the default behavior, however, this depends on the stylesheet."
    },
    {
        "Tag": "<iframe>",
        "Description": "Makes it possible to embed another page within a page. In HTML5 this is known as nested browsing."
    },
    {
        "Tag": "<img>",
        "Description": "For displaying images on a webpage. Example: <img src=\"image.png\">"
    },
    {
        "Tag": "<input>",
        "Description": "Input is used with various attributes to create form input elements."
    },
    {
        "Tag": "<ins>",
        "Description": "Useful for denoting text that has been added to an HTML file since the original version. Updates to a blog post for example. This is typically rendered as underlined text, although this can really be rendered just about any way you want with a stylesheet."
    },
    {
        "Tag": "<kbd>",
        "Description": "Used for keyboard input. This is different from form element text input."
    },
    {
        "Tag": "<keygen>",
        "Description": "Used for authentication with a security certificate."
    },
    {
        "Tag": "<label>",
        "Description": "For assigning labels to interface elements such as forms."
    },
    {
        "Tag": "<legend>",
        "Description": "Useful for making forms easier to understand."
    },
    {
        "Tag": "<li>",
        "Description": "This represents a list item with an <ol> (ordered list) or <ul> (unordered list)."
    },
    {
        "Tag": "<link>",
        "Description": "Used for linking to external resources. Typically seen in <head> referring to an external style sheet. Different from the <a> (anchor) tag."
    },
    {
        "Tag": "<main>",
        "Description": "New to HTML5. These tags enclose the main content of an HTML document."
    },
    {
        "Tag": "<map>",
        "Description": "Used when defining an image map."
    },
    {
        "Tag": "<mark>",
        "Description": "This is essentially used for highlighting. Of course, whether or not highlighting is actually involved depends on the involved stylesheet."
    },
    {
        "Tag": "<menu>",
        "Description": "Used for creating various kinds of menus. This is new to HTML 5.1."
    },
    {
        "Tag": "<menuitem>",
        "Description": "Specify actions that can be taken with a menu."
    },
    {
        "Tag": "<meta>",
        "Description": "Used for specifying various meta information about the document. Meta tags are used within the document <head>."
    },
    {
        "Tag": "<meter>",
        "Description": "Used to represent a number when the minimum and maximum is known, for example 10%."
    },
    {
        "Tag": "<nav>",
        "Description": "Used for specifying a navigational region within a document."
    },
    {
        "Tag": "<noscript>",
        "Description": "For anyone using scripts within their pages, <noscript> is useful for specifying content that should be rendered when scripting isn’t supported."
    },
    {
        "Tag": "<object>",
        "Description": "For embedding objects within a document."
    },
    {
        "Tag": "<ol>",
        "Description": "Ordered list (1. 2. 3.). Use with list item <li>."
    },
    {
        "Tag": "<optgroup>",
        "Description": "For grouping objects."
    },
    {
        "Tag": "<option>",
        "Description": "Used within the <select> tag to specify an option."
    },
    {
        "Tag": "<output>",
        "Description": "Displays the output of an action, such as from a script or form."
    },
    {
        "Tag": "<p>",
        "Description": "Paragraph. Enclose paragraphs in an article within <p> tags."
    },
    {
        "Tag": "<param>",
        "Description": "Use when parameters need to be passed to an object embedded within the document."
    },
    {
        "Tag": "<pre>",
        "Description": "For preformatted text. This can be useful for demonstrating code, especially if there are multiple lines."
    },
    {
        "Tag": "<progress>",
        "Description": "Display the progress of an action, such as with a script."
    },
    {
        "Tag": "<q>",
        "Description": "Quote from some source."
    },
    {
        "Tag": "<rb>",
        "Description": "For Ruby annotations."
    },
    {
        "Tag": "<rp>",
        "Description": "Specify text to be displayed when Ruby annotations are not supported by the browser."
    },
    {
        "Tag": "<rt>",
        "Description": "Text component of a Ruby annotation."
    },
    {
        "Tag": "<rtc>",
        "Description": "Ruby Text Container."
    },
    {
        "Tag": "<ruby>",
        "Description": "Also used for Ruby annotation."
    },
    {
        "Tag": "<s>",
        "Description": "For marking up text that is not longer relevant, applicable, or accurate."
    },
    {
        "Tag": "<samp>",
        "Description": "Sample output one might get from a particular computer program."
    },
    {
        "Tag": "<script>",
        "Description": "Scripts inside of an HTML document are enclosed in the script tags."
    },
    {
        "Tag": "<section>",
        "Description": "A nonspecific means of breaking up content within a webpage into sections."
    },
    {
        "Tag": "<select>",
        "Description": "Used with <option> for selecting a particular option."
    },
    {
        "Tag": "<small>",
        "Description": "Typically used for small print. Useful for comments within the main content."
    },
    {
        "Tag": "<source>",
        "Description": "Used with <audio> and <video> for specifying media source."
    },
    {
        "Tag": "<span>",
        "Description": "Useful for applying styles to or around text, especially inline."
    },
    {
        "Tag": "<strong>",
        "Description": "The enclosed text is of strong importance."
    },
    {
        "Tag": "<style>",
        "Description": "For declaring style sheets within a document."
    },
    {
        "Tag": "<sub>",
        "Description": "For displaying subscript. Useful for math, especially in conjunction with <sup> (superscript)."
    },
    {
        "Tag": "<summary>",
        "Description": "Used in conjunction with the <details> tag for specifying a summary."
    },
    {
        "Tag": "<sup>",
        "Description": "For displaying superscript. Useful for math, especially in conjunction with <sub> (subscript)."
    },
    {
        "Tag": "<table>",
        "Description": "For making tables in an HTML page."
    },
    {
        "Tag": "<tbody>",
        "Description": "Groups table rows."
    },
    {
        "Tag": "<td>",
        "Description": "Table data; this represents a data cell within a table."
    },
    {
        "Tag": "<template>",
        "Description": "Declares HTML snippets that can be used later."
    },
    {
        "Tag": "<textarea>",
        "Description": "For multi-line text entry."
    },
    {
        "Tag": "<tfoot>",
        "Description": "Table footer."
    },
    {
        "Tag": "<th>",
        "Description": "Table header cell."
    },
    {
        "Tag": "<thead>",
        "Description": "Table header row."
    },
    {
        "Tag": "<time>",
        "Description": "Specifies the date/time within a document."
    },
    {
        "Tag": "<title>",
        "Description": "The title of an HTML document."
    },
    {
        "Tag": "<tr>",
        "Description": "A row within a table."
    },
    {
        "Tag": "<track>",
        "Description": "Used to specify text tracks with <audio> and <video>."
    },
    {
        "Tag": "<u>",
        "Description": "Useful for annotating text for various reasons. No longer specifically for underlining, although you can of course still do that with CSS."
    },
    {
        "Tag": "<ul>",
        "Description": "Unordered list. Use with <li> (list item) to make unordered lists."
    },
    {
        "Tag": "<var>",
        "Description": "Defines a variable within the content of an HTML page."
    },
    {
        "Tag": "<video>",
        "Description": "For embedding video within an HTML page."
    },
    {
        "Tag": "<wbr>",
        "Description": "The optional line wrap."
    }
]